Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
              + type = "string"
            }
          + columns {
              + name = "_vcfchromosomemap"
              + type = "string"
            }
          + columns {
              + name = "createdatetime"
              + type = "string"
            }
          + columns {
              + name = "datauseconditions"
              + type = "string"
            }
          + columns {
              + name = "description"
              + type = "string"
            }
          + columns {
              + name = "externalurl"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "name"
              + type = "string"
            }
          + columns {
              + name = "updatedatetime"
              + type = "string"
            }
          + columns {
              + name = "version"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be created
  + resource "aws_glue_catalog_table" "sbeacon-individuals" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_individuals"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "diseases"
              + type = "string"
            }
          + columns {
              + name = "ethnicity"
              + type = "string"
            }
          + columns {
              + name = "exposures"
              + type = "string"
            }
          + columns {
              + name = "geographicorigin"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "interventionsorprocedures"
              + type = "string"
            }
          + columns {
              + name = "karyotypicsex"
              + type = "string"
            }
          + columns {
              + name = "measures"
              + type = "string"
            }
          + columns {
              + name = "pedigrees"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sex"
              + type = "string"
            }
          + columns {
              + name = "treatments"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-individuals-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_individuals_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "diseases"
              + type = "string"
            }
          + columns {
              + name = "ethnicity"
              + type = "string"
            }
          + columns {
              + name = "exposures"
              + type = "string"
            }
          + columns {
              + name = "geographicorigin"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "interventionsorprocedures"
              + type = "string"
            }
          + columns {
              + name = "karyotypicsex"
              + type = "string"
            }
          + columns {
              + name = "measures"
              + type = "string"
            }
          + columns {
              + name = "pedigrees"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sex"
              + type = "string"
            }
          + columns {
              + name = "treatments"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be created
  + resource "aws_glue_catalog_table" "sbeacon-relations" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_relations"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "datasetid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "runid"
              + type = "string"
            }
          + columns {
              + name = "analysisid"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be created
  + resource "aws_glue_catalog_table" "sbeacon-runs" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_runs"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "librarylayout"
              + type = "string"
            }
          + columns {
              + name = "libraryselection"
              + type = "string"
            }
          + columns {
              + name = "librarysource"
              + type = "string"
            }
          + columns {
              + name = "librarystrategy"
              + type = "string"
            }
          + columns {
              + name = "platform"
              + type = "string"
            }
          + columns {
              + name = "platformmodel"
              + type = "string"
            }
          + columns {
              + name = "rundate"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-runs-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_runs_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "librarylayout"
              + type = "string"
            }
          + columns {
              + name = "libraryselection"
              + type = "string"
            }
          + columns {
              + name = "librarysource"
              + type = "string"
            }
          + columns {
              + name = "librarystrategy"
              + type = "string"
            }
          + columns {
              + name = "platform"
              + type = "string"
            }
          + columns {
              + name = "platformmodel"
              + type = "string"
            }
          + columns {
              + name = "rundate"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-terms-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-terms-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_terms_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "kind"
              + type = "string"
            }
          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "term"
              + type = "string"
            }
          + columns {
              + name = "label"
              + type = "string"
            }
          + columns {
              + name = "type"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_crawler.sbeacon-crawler will be created
  + resource "aws_glue_crawler" "sbeacon-crawler" {
      + arn           = (known after apply)
      + configuration = jsonencode(
            {
              + CrawlerOutput = {
                  + Partitions = {
                      + AddOrUpdateBehavior = "InheritFromTable"
                    }
                }
              + Grouping      = {
                  + TableGroupingPolicy = "CombineCompatibleSchemas"
                }
              + Version       = 1
            }
        )
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon-crawler"
      + role          = (known after apply)
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + catalog_target {
          + database_name = "sbeacon_metadata"
          + tables        = [
              + "sbeacon_individuals",
              + "sbeacon_biosamples",
            ]
        }

      + schema_change_policy {
          + delete_behavior = "LOG"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # module.sbeacon.aws_iam_instance_profile.ec2_deidentification_instance_profile will be created
  + resource "aws_iam_instance_profile" "ec2_deidentification_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "sbeacon_backend_ec2_deidentification_instance_profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "sbeacon_backend_ec2_deidentification_instance_role"
      + tags_all    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id   = (known after apply)
    }

  # module.sbeacon.aws_iam_policy.extra-glue-policy will be created
  + resource "aws_iam_policy" "extra-glue-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Extra permissions"
      + id               = (known after apply)
      + name             = "extra-glue-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.aws_iam_role.ec2_deidentification_instance_role will be created
  + resource "aws_iam_role" "ec2_deidentification_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon_backend_ec2_deidentification_instance_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.aws_iam_role.glue_role will be created
  + resource "aws_iam_role" "glue_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "glue_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.aws_iam_role.sagemaker_jupyter_instance_role will be created
  + resource "aws_iam_role" "sagemaker_jupyter_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sagemaker.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon_backend_sagemaker_jupyter_instance_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.aws_iam_role_policy.ec2_deidentification_policy will be created
  + resource "aws_iam_role_policy" "ec2_deidentification_policy" {
      + id          = (known after apply)
      + name        = "sbeacon_backend_ec2_deidentification_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.sbeacon.aws_iam_role_policy_attachment.glue-extra-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "glue-extra-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "glue_role"
    }

  # module.sbeacon.aws_iam_role_policy_attachment.glue-service-role-attachment will be created
  + resource "aws_iam_role_policy_attachment" "glue-service-role-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "glue_role"
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer will be created
  + resource "aws_lambda_layer_version" "binaries_layer" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "sbeacon/binaries.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "sbeacon_backend_binaries_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetConfiguration will be created
  + resource "aws_lambda_permission" "APIGetConfiguration" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getConfiguration"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetConfigurationInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetEntryTypes will be created
  + resource "aws_lambda_permission" "APIGetEntryTypes" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getEntryTypes"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetEntryTypesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetFilteringTerms will be created
  + resource "aws_lambda_permission" "APIGetFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getFilteringTerms"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetInfo will be created
  + resource "aws_lambda_permission" "APIGetInfo" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getInfo"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetInfoInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetProjects will be created
  + resource "aws_lambda_permission" "APIGetProjects" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getProjects"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetProjectsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetinfo-root will be created
  + resource "aws_lambda_permission" "APIGetinfo-root" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getInfo"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetinfoRootInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetmap will be created
  + resource "aws_lambda_permission" "APIGetmap" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getMap"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetMapInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIadmin_proxy will be created
  + resource "aws_lambda_permission" "APIadmin_proxy" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-admin"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIadmin_proxyInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalyses will be created
  + resource "aws_lambda_permission" "APIanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms will be created
  + resource "aws_lambda_permission" "APIanalysesFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesId will be created
  + resource "aws_lambda_permission" "APIanalysesId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants will be created
  + resource "aws_lambda_permission" "APIanalysesIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamples will be created
  + resource "aws_lambda_permission" "APIbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms will be created
  + resource "aws_lambda_permission" "APIbiosamplesFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesId will be created
  + resource "aws_lambda_permission" "APIbiosamplesId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdruns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdrunsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasets will be created
  + resource "aws_lambda_permission" "APIdatasets" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIdatasetsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsId will be created
  + resource "aws_lambda_permission" "APIdatasetsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIdatasetsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms will be created
  + resource "aws_lambda_permission" "APIdatasetsIdfiltering_terms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdfiltering_termsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants will be created
  + resource "aws_lambda_permission" "APIdatasetsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals will be created
  + resource "aws_lambda_permission" "APIdatasetsIdindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdportal_proxy will be created
  + resource "aws_lambda_permission" "APIdportal_proxy" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-dataPortal"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdportal_proxyInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variants will be created
  + resource "aws_lambda_permission" "APIg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsId will be created
  + resource "aws_lambda_permission" "APIg_variantsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIg_variantsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals will be created
  + resource "aws_lambda_permission" "APIg_variantsIdindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsIdindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividuals will be created
  + resource "aws_lambda_permission" "APIindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIindividualsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsId will be created
  + resource "aws_lambda_permission" "APIindividualsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIindividualsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants will be created
  + resource "aws_lambda_permission" "APIindividualsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIruns will be created
  + resource "aws_lambda_permission" "APIruns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIrunsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsId will be created
  + resource "aws_lambda_permission" "APIrunsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsIdanalyses will be created
  + resource "aws_lambda_permission" "APIrunsIdanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsIdanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsIdg_variants will be created
  + resource "aws_lambda_permission" "APIrunsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.S3deidentifyFiles will be created
  + resource "aws_lambda_permission" "S3deidentifyFiles" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowS3deidentifyFilesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.S3updateFiles will be created
  + resource "aws_lambda_permission" "S3updateFiles" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowS3updateFilesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.SNSperformQuery will be created
  + resource "aws_lambda_permission" "SNSperformQuery" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowSNSperformQueryInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.SNSsplitQuery will be created
  + resource "aws_lambda_permission" "SNSsplitQuery" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowSNSsplitQueryInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.dataportal-bucket will be created
  + resource "aws_s3_bucket" "dataportal-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gaspi-dataportal-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.lambda-layers-bucket will be created
  + resource "aws_s3_bucket" "lambda-layers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gaspi-lambda-layers-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.metadata-bucket will be created
  + resource "aws_s3_bucket" "metadata-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gaspi-metadata-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket will be created
  + resource "aws_s3_bucket" "variants-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gaspi-variants-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.dataportal_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "dataportal_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.lambda-layers will be created
  + resource "aws_s3_bucket_acl" "lambda-layers" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.metadata will be created
  + resource "aws_s3_bucket_acl" "metadata" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.variants_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "variants_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.dataportal-bucket will be created
  + resource "aws_s3_bucket_cors_configuration" "dataportal-bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
              + "x-amz-abort-date",
              + "x-amz-multipart-parts-count",
            ]
            id              = null
          + max_age_seconds = 36000
        }
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.metadata-bucket will be created
  + resource "aws_s3_bucket_cors_configuration" "metadata-bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "HEAD",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = []
            id              = null
          + max_age_seconds = 3000
        }
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.metadata_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "metadata_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "clean-old-query-results"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 2
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "query-results/"
            }
        }
      + rule {
          + id     = "clean-old-cached-results"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 2
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "query-responses/"
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.staging_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "staging_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "remove-zombie-staging-files"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 3
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "staging/"
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.variants_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "variants_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "clean-old-queries"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 1
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "variant-queries/"
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be created
  + resource "aws_s3_bucket_notification" "updateFiles" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
              + "s3:ObjectRemoved:*",
            ]
          + filter_prefix       = "projects/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "staging/projects/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.dataportal_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "dataportal_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.lambda_layers_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "lambda_layers_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.metadata_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "metadata_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.variants_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "variants_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be created
  + resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clone-gaspi-notebooks"
      + on_create = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK"
      + on_start  = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK"
      + tags_all  = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.aws_sns_topic.performQuery will be created
  + resource "aws_sns_topic" "performQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "performQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.sbeacon.aws_sns_topic.splitQuery will be created
  + resource "aws_sns_topic" "splitQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "splitQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.sbeacon.aws_sns_topic_subscription.performQuery will be created
  + resource "aws_sns_topic_subscription" "performQuery" {
      + arn   
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.